<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Consent
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for consent screens.
    |
    */

    'agree' => 'Макулмун',
    'disagree_logout' => 'Макул эмесмин, чыгуу',
    'skip' => 'Өткөрүү',
    'save' => 'Сактоо',

    'privacy' => [
        'dialog_title' => 'Сиздин тастыктооңүз керек',
        'dialog_description' => 'Сураныч, купуялык саясатты кунт коюп окуңүз. Бул саясат сиз жөнүндө маалымат кантип иштетитлет жана тиешелүү укуктарыңыз боюнча.',
        'show_full_text' => 'Текстин баарын көрсөтүү',
    ],

    'others' => [
        'dialog_title' => 'Суроо:',
        'dialog_description' => 'K-Box-тун кээ бир функциялары иштөө үчүн сиздин такстыктооңуз керек. Бирок, макул болбосоңуз дагы K-Box-ту колдоно бересиз.',
    ],

    'notification' => [
        'dialog_title' => 'E-Mail билдирүүлөр',
        'dialog_description' => 'Башка колдонуучулар сиздин файлдарыңыз менен иштесе, e-mail аркылуу билдирүү алуу.',
        'agree_label' => 'Билдирүүлөрдү алууга макулмун',
    ],

    'statistics' => [
        'dialog_title' => 'Колдонуу статистикасы',
        'dialog_description' => 'K-Box-ту жакшыртууга жардам бериңиз. Колдонуу статистиканы топтоого уруксат бериңиз.',
        'agree_label' => 'K-Box-ту колдонуу боюнча статистиканы топтоого макулмун',
    ],


];
