<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы напоминания пароля
    |--------------------------------------------------------------------------
    |
    | Последующие языковые строки возвращаются брокером паролей на неудачные
    | попытки обновления пароля в таких случаях, как ошибочный код сброса
    | пароля или неверный новый пароль.
    |
    */

    "password" => "Сырсөз алты белгиден болушу керек",
    "user"     => "Бул электрондук почта табылган жок",
    "token"    => "Сырсөздү жаңыртуу үчүн шилтеменин убакыты өтүп кетти, ал беш мүнөттүн ичинде эле активдүү",
    "sent"     => "Сырсөздү жаңыртуу үчүн кат жөнөтүлдү",
    "reset"    => "Сырсөз жаңыланды",

    'forgot' => [

        'link' => 'Сырсөздү унуттуңузбу?',

        'title' => 'Сырсөздү унуттуңузбу?',

        'submit' => 'Сырсөздү жаңыртуу үчүн шилтемени суроо',
        'instructions' => 'Сырсөздү жаңыртуу үчүн шилтемени жөнөтүүгө электрондук почтаны жазыңыз. Шилтеме беш мүнөттүн ичинде активдүү болот.',
        'email_subject' => 'K-Box сырсөзүн жаңыртуу',

    ],

    'reset' => [

        // 'link' => 'Forgot your password?',

        'title' => 'Сырсөздү өзгөртүңүз',

        'instructions' => 'Жыңы сырсөздү жазыңыз. Сырсөз тамгалардан жана сандардан түзүлүп, сегиз белгиден кем болбош керек.',

        'submit' => 'Сырсөздү өзгөртүңүз',

        'email_subject' => 'Сырсөз өзгөртүлдү',

    ],

];
