<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Search page Language Lines
    |--------------------------------------------------------------------------
    |
    |
    */

    'page_title' => 'Издөө',

    'form' => [
        'placeholder' => 'Издөө...',
        'placeholder_in' => '":location" ичинде издөө...',
        'hint' => 'Сөздөрдү жана сүйлөмдөрдү издөө. Тагыраак издөө үчүн AND жана OR колдонсоңуз болот.',
        'hint_in' => ':location ичинде издөө',
        'submit' => 'Издеп баштаңыз',
        'public_switch_alt' => 'K-Link тармагында издөө',
        'private_switch_alt' => 'Жабык документтердин арасында издөө',
    ],

    'error' => 'K-Link тармагына кошулуу учурунда ката кетти, колдоо кызматы иштеп жатат',
    
    'failure' => 'Издөө учурунда ката кетти. Дагы кайталанса, администраторго кайрылыңз.',
    
    'empty_query' => 'Эң негизги жана маанилүү сөздөрдү жазыңыз',

    'loading_filters' => 'Электер жүктөлүп жатат...',

    'no_results' => '<strong>:collection</strong> коллекцияда сиздин талабыңыз <strong>:term</strong> боюнча документтер табылган жок',
    'no_results_no_markup' => ':collection коллекцияда сиздин талабыңыз :term боюнча документтер табылган жок',
    'no_results_generic' => 'Суроо-талапка ылайыктуу документтер жок',
    'no_results_for_term' => '":term" суроо-талапка ылайыктуу документтер жок',

    'try_message' => ':startwithlink менен башталган сөздөрдү издеп көрүңүз',

    'facets' => [
        'institutionId' => 'Уюм',
        'language' => "Тили",
        'documentType' => "Документтин түрү",
        'documentGroups' => "Коллекциялар",
        'projectId' => 'Долбоор',
        'collections' => "Коллекциялар",
        'projects' => 'Долбоор'

    ],

];
