<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Consent
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for consent screens.
    |
    */

    'agree' => 'Розӣ шудан',
    'disagree_logout' => 'Норозигӣ баён кардан ва баромадан',
    'skip' => 'Гузарондан',
    'save' => 'Интихоботи маро захира кунед',

    'enabled' => 'фаъол аст',

    'privacy' => [
        'dialog_title' => 'Тасдиқи шумо лозим аст',
        'dialog_description' => 'Лутфан сиёсати нави махфияти моро, аз он ҷумла тамоми маълумот дар бораи муносибат бо мо ва ҳуқуқҳои марбут ба маълумоти шуморо бодиққат аз назар гузаронед.',
        'show_full_text' => 'Матни пурраи ҳуқуқиро ба ман нишон диҳед',
    ],
    
    'others' => [
        'dialog_title' => 'Як савол',
        'dialog_description' => 'K-Box якчанд функсияҳоро пешниҳод мекунад, ки мо мехоҳем аз шумо рухсат талаб кунем. Дар сурати рад кардан, шумо ба ҳар ҳол метавонед K-Box-ро истифода баред.',
    ],
    
    'notification' => [
        'dialog_title' => 'Огоҳиномаҳои почтаи электронӣ',
        'dialog_description' => 'Ҳар як алоқаи корбарони дигар бо шумо ва ҳуҷҷатҳоятон дар як E-Mail огоҳнома қабул кунед.',
        'agree_label' => 'Ман розигӣ баён мекунам,ки огоҳиномаи почтаи электронӣ қабул кунам',
    ],
    
    'statistics' => [
        'dialog_title' => 'Омори истифодабарӣ',
        'dialog_description' => 'Ба мо дар такмил додани система кӯмак расонед ва ба ҷамъоварӣ кардани омори пинҳонӣ оид ба дидан ва истифодаи барнома.',
        'agree_label' => 'Ман розӣ ҳастам, ки провайдери K-Box метавонад аз рӯи дидани ман ва истифодаи барнома омор эҷод кунад',
    ],
    

];
