<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Languages code Language Lines
    |--------------------------------------------------------------------------
    |
    | this lines are used for output a more human friendly version of the language codes
    |
    */

    'no_language' => 'Забон муайян нашуд',
    '' => 'Забон муайян нашуд',
    '__' => 'Забон муайян нашуд',
    'en' => 'Англисӣ',
    'ru' => 'Русӣ',
    'tg' => 'Тоҷикӣ',
    'ky' => 'Кирғизӣ',
    'de' => 'Олмонӣ',
    'it' => 'Итолиёвӣ',
    'fr' => 'Фаронсавӣ',
    
];
