<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Administrator Messages Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for rendering particular messages
    | to the user
    |
    */
    
    'mail_testing_mode_msg' => 'Танзимоти почтаи электронӣ дуруст нест, фиристодани паёми почтаи электронӣ ба истифодабарандагони нав ё мавҷуда имкон нест. <a href=":url">Иваз кун</a>',
    'mail_not_configured' => 'Насбкунии E-Mail диққати шуморо талаб мекунад.<br/><a href=":url">Лутфан танзимоти почтаи электрониро нигох кунед</a>.',
    'mail_config_msg' => 'Лутфан ба охир расонед <a href=":url">Насбкунии хадамоти E-Mail</a>.',
    'account_mail_msg' => 'Лутфан <a href=":url"> E-Mail-и аккаунтро иваз кунед </a> ба суроғаи воқеии E-Mail, вагарна Шумо паемро дастрас кардан наметавонед.',

    'long_running_msg' => '<strong>Ҳоло кор карда истодааст!</strong> Ба назар чунин мерасад, ки ин амал хеле тӯл мекашад, мутаассифем,.',
    
    'terms_of_use' => 'Бо ворид кардан ё мубодила намудани санад шумо бо <a href=":policy_link">Сиёсати хизматрасонӣ</a> розӣ ҳастед.',

    'contacts_not_configured' => 'Маълумот дар бораи тамос диққати шуморо талаб мекунад. <a href=":url">Лутфан, онҳоро аз назар гузаронед</a> дар қисми шахси.',
];