<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Password Reminder Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are the default lines which match reasons
    | that are given by the password broker for a password update attempt
    | has failed, such as for an invalid token or invalid new password.
    |
    */

    "password" => "Парол бояд на камтар аз шаш рақам бошанд.",
    "user" => "Мо наметавонем истифодабарандаи бо ин почтаи электронӣ пайдо кунем.",
    "token" => "Мухлати линки барои иваз кардани пароле, ки шумо истифода бурдед, гузашт.. Он танҳо 5 дақиқа пас аз дархости ивазкунии парол дастрас аст.",
    "sent" => "Линк барои иваз намудани парол фиристонда шуд!",
    "reset" => "Парол иваз шуд!",

    'forgot' => [

        'link' => 'Паролро фаромуш кардед?',

        'title' => 'Паролро фаромуш кардед?',

        'instructions' => 'Барои баркарор кунии парол почтаи электронии худро нишон дихед. Паем барои ивазкунии парол ба почтаи электронии шумо фиристонда мешавад.',

        'submit' => 'Дархости ивазкунии парол',

        'email_subject' => 'Дархости ивазкунии пароли K-Box',

    ],

    'reset' => [

        'title' => 'Пароли аккаутро иваз кунед',

        'instructions' => 'Лутфан пароли нави иборат аз 8 аломат (ракам ва харф) интихоб намоед.',

        'submit' => 'Ивазкунии парол',

        'email_subject' => 'Пароли аккаунти K-Box-и Шумо иваз шуд',

    ],

    
];