<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Search page Language Lines
    |--------------------------------------------------------------------------
    |
    |
    */

    'page_title' => 'Ҷустуҷӯ',

    'form' => [
        'placeholder' => 'Ҷустуҷӯ...',
        'placeholder_in' => 'Ҷустуҷӯ дар ":location"...',
        'hint' => 'Калимаҳо ва ибораҳо ҷустуҷӯ кунед, шумо метавонед ВА ва Ё барои ҷустуҷӯ истифода баред .',
        'hint_in' => 'Ҷустуҷӯ дар дохили :location',
        'submit' => 'Ҷустуҷӯро оғоз кунед',
        'public_switch_alt' => 'Ҷустуҷӯи санадхои умуми',
        'private_switch_alt' => 'Ҷустуҷӯи санадхои шахси',
    ],

    'error' => 'Мушкилие сар зад хангоми пайвастшави ба K-Link ва чусучуй дар он. Гурухи кумакрасони огоҳ карда шуда, дар ҳалли он кор мекунад.',

    'failure' => 'Аз тарафи мо мушкилие вуҷуд дорад, дархости ҷустуҷӯӣ коркард карда намешавад. Агар мушкилот боқӣ мемонанд, администратонро хабар кунед.',

    'empty_query' => 'Дар майдони ҷустуҷӯи, ки дар боло аст, чизеро дохил кунед ва ҷустуҷӯ кунед.',

    'loading_filters' => 'Ичрои филтрҳо…',

    'no_results' => 'Бубахшед чизе барои  <strong>:term</strong> дар <strong>:collection</strong> ёфт нашуд.',
    'no_results_no_markup' => 'Бубахшед чизе барои :term дар :collection ёфт нашуд ',
    'no_results_generic' => 'Санаде бо меъёрҳои ҷустуҷӯи шумо мувофиқат намекунад.',
    'no_results_for_term' => 'Ягон санад ба ҷустуҷӯи ":term" мувофиқ нест.',

    'try_message' => 'Кушиш кун ҷустуҷӯи бо калимаи :startwithlink огоз кун',

    'facets' => [
        'institutionId' => 'Ташкилот',
        'language' => 'Забон',
        'documentType' => 'Намуди санад',
        'documentGroups' => 'Коллексияхо',
        'projectId' => 'Лоиҳа',
        'collections' => "Коллексияхо",
        'projects' => 'Лоиҳа',
        'copyright_usage' => 'Литсензия'
    ],

];
