<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Language Lines for the settings page
    |--------------------------------------------------------------------------
    */

    'page_title' => 'Танзими кисмати ҷуғрофии K-Box',

    'description' => 'Ин саҳифа танзими кисмати ҷуғрофӣро дар бар мегирад',

    'geoserver' => [
        'title' => 'Пайвасткунии GeoServer',
        'description' => 'Параметрҳое, ки барои пайвастшавӣ ба GeoServer истифода мешавад. GeoServer барои нигоҳдорӣ, пешнамоиш ва тағир додани файлҳои ҷуғрофӣ истифода мешавад',

        'url' => 'Суроғаи geoserver (мисол. https://domain.com/geoserver/)',
        'username' => 'Номи истифодабарандаи GeoServer тасдиқ кунед',
        'password' => 'Пароли истифодабаранди GeoServer тасдиқ кунед',
        'workspace' => 'Коргоҳи GeoServer барои истифода (мисол. kbox)',
    ],

    'gdal' => [
        'available' => 'Китобхонаи Gdal насб карда шудааст. (:version)',
        'not_available' => 'Китобхонаи Gdal дастрас нест, базе кисмхояш мукин кор накунанд.',
    ],

    'connection' => [
        'established' => 'GeoServer (:version) пайваст карда шудааст.',
        'failed' => 'Ба GeoServer пайваст нашуд. :error',
    ],

    'providers' => [
        'title' => 'Таҳиягари харита',

        'description' => 'Таҳиякунандагони харитаҳои асосиро танзим кунед',

        'provider_created' => 'Таҳиягари харита ":name"',
        'provider_updated' => 'Таҳиягари харитаи ":name" иваз карда шуд',
        'default_provider_updated' => ' Таҳиягари аслӣ ба ":name" тағйир ёфт',
        'providers_enabled' => 'Таҳиягари харита фаъол карда нушудааст|{1}Provider ":name" enabled|[2,*]Enabled ":name" ва :count дигар таҳиягарон',
        'providers_disabled' => 'Таҳиягари харита гайрфаъол нушудааст|{1}Provider ":name" disabled|[2,*]Disabled ":name" ва :count дигар таҳиягарон',
        'provider_deleted' => 'Таҳиягари харита ":name" нест карда шуд',
        'provider_delete_denied_is_default' => 'Таҳиягари харита асоси нест карда намешавад ":name". Лутфан аввал таҳиягари харитаи асосиро иваз кунед.',

        'create_title' => 'Таҳиягари харитаро соз',
        'create_description' => 'Таҳиягари навро соз',

        'edit_title' => 'Таҳрири таҳиягари харитаи ":name"',
        'edit_description' => 'Таҳрири таҳиягари харита',

        'types' => [
            'tile' => 'Таҳиягари харитахои порчаги',
            'wms' => 'Web Map Service (WMS)',
        ],

        'attributes' => [
            'id' => 'id',

            'default' => 'асоси',

            'enabled' => 'фаъол',

            'subdomains' => 'Субдоменҳо',
            'subdomains_description' => 'Барои таҳия кардани харитаҳои порчаги, порчаҳо метавонанд аз доменҳои гуногун гирифта шаванд, то ки суръати боркуниро тезонад . Дар url одатан ин бо ишораи {s} нишон дода мешавад.',

            'type' => 'Намуди таҳиягари харита',
            'type_description' => 'Агар аз намуди харитаи порчаги ва е аз тарафи Web Map Service (WMS) тахия шудааст',

            'label' => 'Ном',
            'label_description' => 'Номи ба ин таҳиягар таъин шуда. Ном бояд аз дигар таҳиягарони мавчудбуда фарк кунад',

            'url' => 'Url',
            'url_description' => 'URL формат барои боркардани харита',

            'attribution' => 'Шарҳ',
            'attribution_description' => 'Ин сатр ба истифодабарандагон хангоми интихоби провайдери пешниҳод карда мешавад. Ин одатан огоҳиҳои ҳуқуқи муаллифӣ ва иҷозатномадиҳиро дар бар мегирад',

            'maxZoom' => 'Сатҳи максималии наздиккуни',
            'maxZoom_description' => 'Сатҳи максималии наздиккуни, ки аз тарафи таҳиягари харита ичозат дода мешавад',

            'layers' => 'қабатҳо',
            'layers_description' => 'Кабатҳои барои истифода, ки аз тарафи таҳиягари харита пешниход шуданд. Факат хангоми истифодаи Web Map Services чори мешавад',
        ],

    ],

    'validation' => [
        'url' => [
            'regex' => 'Url бояд бо http:// or https:// сар шавад, мисол. https://tile.openstreetmaps.com/{x}/{y}/{z}.png',
        ],
        'label' => [
            'not_in' => "Номи таҳиягар бояд такрор нашавад. [:label] - ин ном алакай мавчуд аст",
        ],
        'id' => [
            'not_found' => 'Таҳиягар пайдо нашуд',
        ],
        'type' => [
            'not_changeable' => "Намуди таҳиягар [:current] ба [:new] иваз карда намешавад",
        ],
        'default_map' => [
            'in' => 'Харитаи интихобшуда дар система дастрас нест',
        ]
    ],
    
];
