<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Consent
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for consent screens.
    |
    */

    'agree' => 'Согласен',
    'disagree_logout' => 'Не согласен, выйти',
    'skip' => 'Пропустить',
    'save' => 'Сохранить мои настройки',

    'privacy' => [
        'dialog_title' => 'Нужно ваше подтверждение',
        'dialog_description' => 'Пожалуйста, внимательно ознакомьтесь с политикой конфиденциальности включаю информацию о том как мы обрабатываем ваши данные и с информацией о ваших правах',
        'show_full_text' => 'Показать полный текст',
    ],
    
    'others' => [
        'dialog_title' => 'Вопрос:',
        'dialog_description' => 'Работа некоторых функций K-Box требует вашего согласия. Но даже в случае отказа вы сможете продолжать использовать K-Box.',
    ],
    
    'notification' => [
        'dialog_title' => 'E-Mail уведомления',
        'dialog_description' => 'Получать email уведомления о любой активности касающейся вас и ваших файлов',
        'agree_label' => 'Согласен получать email уведомления',
    ],
    
    'statistics' => [
        'dialog_title' => 'Статистика использования',
        'dialog_description' => 'Помогите улучшить систему через сбор статистики просмотров и использования приложения',
        'agree_label' => 'Согласен с тем, что провайдер K-Box может собирать статистику просмотров и использования приложения',
    ],
    

];
