<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Dashboard Welcome Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used on the welcome page when no user has
    | done the login procedure
    |
    */
    
    'welcome' => [

        'hero_title' => 'Добро пожаловать в K-Link DMS<br/>Проектное издание',
        // 'hero_sub' => 'Публичный поиск документов среди <strong>:documents</strong> документов <strong>:institutions</strong> организаций.',
        // 'hero_description' => 'Вы можете использовать публичный поиск, но если вы хотите добавлять документы в избранное, иметь доступ к закрытым документам организации и управлять своими документами, то вам нужно зарегистрироваться или войти под своей учетной записью.',

    ]

];
