<?php

return [

	/*
	|--------------------------------------------------------------------------
	| Collections Language Lines
	|--------------------------------------------------------------------------
	|
	|
	*/

	'collections' => array(
		'title' 		=> 'Коллекция',
		'personal_title' => 'Моя Коллекция',
		'private_title' => 'Проекты',
		'description'   => 'Коллекции помогают упорядочить ваши документы.',
		
		'empty_private_msg' => 'На данный момент проектов нет.',

	),

	'create_btn' => 'Создать',
	'save_btn' => 'Сохранить',
	'loading' => 'Сохраняю коллекцию...',

	'panel_create_title' => 'Создать новую Коллекцию',

	'panel_edit_title' => 'Изменить Коллекцию <strong>:name</strong>',

	'created_on' => 'создано',
	'created_by' => 'создано',

	'private_badge_label' => 'Личная Коллекция документов',

	'group_icon_label' => 'Коллекция',

	'empty_msg' => 'Нет существующих коллекций. Создайте коллекцию.',


	'form' => array(
		'collection_name_placeholder' => 'Название коллекции',
		'collection_name_label' => 'Название коллекции',

		'parent_label' => 'Родительская коллекция',
		'parent_project_label' => 'Коллекция Проекта',

		'make_public' => 'Сделать данную коллекцию видимой для пользователей Проекта.',
		'make_private' => 'Сделать эту коллекцию Личной',
	),
	
	
	
	'people' => array(
		
		'page_title' => 'Группы',
			
		'no_users' => 'Невозможно добавить пользователей в эту группу. Пожалуйста, свяжитесь с вашим администратором или удостоверьтесь, что пользователи могут создавать и получать совместный доступ к документам.',
		
		'available_users' => 'Доступные пользователи',
		'available_users_hint' => 'Перетащите пользователя с этого списка в группу для его добавления.',
		
		'remove_user' => 'Убрать с группы',
		
		'saving' => 'Сохранение...',
		
		'invalidargumentexception' => 'Извините, опреация не может быть выполнена. :exception',
	),

];
