<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Languages code Language Lines
    |--------------------------------------------------------------------------
    |
    | this lines are used for output a more human friendly version of the language codes
    |
    */

    'no_language' => 'Язык не распознан',
    '' => 'Язык не распознан',
    '__' => 'Язык не распознан',
    'en' => 'Английский',
    'ru' => 'Русский',
    'tg' => 'Таджикский',
    'ky' => 'Кыргызский',
    'de' => 'Немецкий',
    'it' => 'Итальянский',
    'fr' => 'Французский',

];
