<?php

return [

	/*
	|--------------------------------------------------------------------------
	| Mail messages
	|--------------------------------------------------------------------------
	|
	|
	*/


	'welcome' => array(

		/*
			Welcome mail template
		 */

		'disclaimer' => 'Это письмо содержит информацию о вашей учетной записи, пожалуйста, сохраните его в безопасном месте.',
		'welcome' => 'Добро пожаловать, :name,',
		'credentials' => 'теперь у вас есть доступ в K-LINK DMS вашей организации с<br/> учетной записью <strong>:mail</strong><br/>и паролем <strong>:password</strong>',

		'login_button' => '<a href=":link">Логин</a>',
		

	),

    'password_reset_subject' => 'Вы запросили восстановление пароля для вашего аккаунта в K-DMS',
	
];
