<?php

return [

	/*
	|--------------------------------------------------------------------------
	| Mail messages
	|--------------------------------------------------------------------------
	|
	|
	*/


	'welcome' => array(

		/*
			Welcome mail template
		 */

		'disclaimer' => 'Это письмо содержит информацию о вашей учетной записи, пожалуиста сохраните его в безопасном месте.',
		'welcome' => 'Добро пожаловать, :name,',
		'credentials' => 'теперь у вас есть доступ в СУД К-Линк вашей организации с<br/> учетной записью <strong>:mail</strong><br/>и паролем <strong>:password</strong>',

		'login_button' => '<a href=":link">Логин</a>',
		

	),


	
];
