<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Mail messages
    |--------------------------------------------------------------------------
    |
    |
    */

    'welcome' => [

        /*
            Welcome mail template
         */

        'disclaimer' => 'Это письмо содержит информацию о вашей учетной записи, пожалуйста, сохраните его в безопасном месте.',
        'welcome' => 'Добро пожаловать, :name,',
        'credentials' => 'Вы можете пройти в K-LINK DMS вашей организации, используя <br/> имя пользователя <strong>:mail</strong><br/>и пароль <strong>:password</strong>',

        'login_button' => '<a href=":link">Войти в систему</a>',
        

    ],

    'password_reset_subject' => 'Вы запросили ссылку для сброса пароля для вашего аккаунта в K-LINK DMS',
    
];
