<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Administrator Messages Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for rendering particular messages
    | to the user
    |
    */
    
    'mail_testing_mode_msg' => 'Почта в пробном режиме, ни одно письмо не может быть отправлено. <a href=":url">Изменить</a>',//Check with Alessio
    'mail_not_configured' => 'Пожалуйста, проверьте конфигурацию электронной почты.<br/><a href=":url">Просмотреть настройки почты</a>.',
    'mail_config_msg' => 'Пожалуйста, завершите <a href=":url">конфигурирование почтовой службы</a>.',
    'account_mail_msg' => 'Пожалуйста, <a href=":url">измените учетную запись вашего электронного ящика</a> на существующую, иначе вы не сможете получать письма.',
    
    'long_running_msg' => '<strong>Все еще работаем!</strong> Похоже, что это действие занимает много времени, извините.',
    
    'terms_of_use' => 'При загрузке или распространении документов, вы соглашаетесь с <a href=":policy_link">Политикой обслуживания</a> системы',

    'contacts_not_configured' => 'Контактные данные требуют вашего внимания. <a href=":url">Просмотрите их</a> на странице Реквизитов.',

    'default_license_not_set' => 'Стандартная лицензия не настроена. <a href=":url">Пожалуйста, выберите стандартную лицензию</a>.',
    'available_licenses_not_set' => 'Список доступных лицензий не настроен. <a href=":url">Пожалуйста, проверьте список доступных лицензий</a>.',
    
    'license_configuration_error' => '<strong> На данном K-Box не заданы обязательные настройки по защите авторского права "Все права защищены", пожалуйста, обратитесь к вашему администратору.</strong>.<br/>Это может отобразиться на функции поиска документов и их публикации.',
    
    // general upload blocked message for users
    'uploads_blocked' => 'По техническим причинам загрузка новых файлов на время приостановлена',
    
    // upload blocked message for administrators
    'uploads_blocked_admin' => 'Функция загрузки новых файлов заблокирована, пожалуйста проверьте настройки',
];

