<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Administrator Messages Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for rendering particular messages
    | to the user
    |
    */
    
    'mail_testing_mode_msg' => 'Почта а пробном режиме, ни одно письмо не может быть отправлено. <a href=":url">Изменить это</a>',//Check with Alessio
    'mail_config_msg' => 'Пожалуйста, завершите <a href=":url">конфигурирование почтовой службы</a>.',
    'account_mail_msg' => 'Пожалуйста, <a href=":url">измените учетную запись вашего электронного ящика</a> на существующую, иначе вы не сможете получать письма.',
    
    'long_running_msg' => '<strong>Все еще работаем!</strong> Похоже, что это действие занимает много времени, извините.',
    
    'terms_of_use' => 'При загрузке или распространении документов, вы соглашаетесь с <a href=":policy_link">Политикой обслуживания</a> системы',
];
