<?php

return [

	/*
	|--------------------------------------------------------------------------
	| Shared page Language Lines
	|--------------------------------------------------------------------------
	|
	*/

	'share_btn' => 'Поделиться',

	'share_panel_title' => 'Поделиться :num элементами|Поделиться :num элементом|Поделиться :num элементами',

	'share_created_msg' => ':num обменов создано|:num обмен создан|:num обмена создано',

	'with_label' => 'Поделиться с',

	'what_label' => 'Вот с чем вы хотите поделиться',

	'empty_with_me_message' => 'Никто с вами не поделился документами :(',

	'empty_by_me_message' => 'Вы не поделились ни с одним документом или коллекцией.',

	'shared_by_me_title' => 'Я поделилась',
	'shared_by_me_count' => ':num элементами|:num элементом|:num элементами',

	'shared_with_me_title' => 'Другие поделились',
	
	'shared_with_label' => 'Поделился с ',
	'shared_by_label' => 'Поделился',
	
	'bulk_destroy' => 'Обмен удален|Некоторые разделяемые документы не могут быть удалены<br/>:errors|Некоторые разделяемые документы не могут быть удалены<br/>:errors',
	
	
];
