<?php

return [

	/*
	|--------------------------------------------------------------------------
	| Shared page Language Lines
	|--------------------------------------------------------------------------
	|
	*/

	'page_title' => 'Документы в совместном доступе',
	
	'share_btn' => 'Предоставить совместный доступ',

	'share_panel_title' => 'Предоставить доступ к :num элементу|Предоставить доступ к :num элементам|Предоставить доступ к :num элементам',

	'share_panel_title_alt' => 'Предоставить доступ к ":what"|Предоставить доступ к ":what" и :count другим файлам|Предоставить доступ к ":what" и :count другим файлам',

	'share_created_msg' => ':num доступ создан|:num доступа создано|:num доступов создано',

	'with_label' => 'Предоставить доступ к',

	'what_label' => 'Вы предоставляете совместный доступ к данному файлу',

	'empty_with_me_message' => 'Никто пока не предоставил вам совместного доступа к документам :(',

	'empty_by_me_message' => 'Вы не предоставили совместного доступа ни к одному документу или коллекции.',

	'shared_by_me_title' => 'Мною предоставленный совместный доступ',
	'shared_by_me_count' => 'Предоставлен доступ к :num элементу|:num элементам|:num элементам',

	'shared_with_me_title' => 'Доступные мне',
	
	'shared_with_label' => 'Вами предоставлен доступ к',
	'shared_by_label' => 'Доступ предоставлен',
	
	'bulk_destroy' => 'Доступ к документу удален|Совместный доступ к некоторым документам не может быть удален<br/>:errors',
	
	'share_link_section' => 'Поделиться документом с помощью ссылки',
    'download_link_copy' => 'Копировать ссылку на загрузку документа',
    'document_link_copy' => 'Копировать ссылку к документу',
    'preview_link_copy' => 'Копировать ссылку на просмотр документа',
    
    'link_copied_to_clipboard' => 'Ссылка была скопирована. Теперь вы можете ее вставить, используя комбинацию CTRL+V.',
	
	'dialog' => [
        'share_created' => 'Предоставлено',
        'collection_shared' => 'Совместный доступ к коллекции предоставлен',
        'collection_shared_text' => 'Доступ к коллекции предоставлен',
        'document_shared' => 'Предоставлено',
        'document_shared_text' => 'Доступ к документу предоставлен',
    ]
];
