<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Starred Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for localizing messages that pertain
    | to the starred feature.
    |
    */
    'add' => 'Добавить в Избранное',
    'remove' => 'Удалить из Избранного',
    'empty_message' => 'Здесь показаны важные и интересные вам документы',

    'page_title' => 'Избранное',

    'starred_count' => '{0} нет документов в Избранном|{1} :number документ в Избранном|{2,4} :number документа в Избранном|{5,*} :number документов в Избранном',
    'starred_count_alt' => '{0} документ не добавлен в Избранное|{1} :number раз добавлен в Избранное|{2,4} :number раза добавлен в Избранное|{5,*} :number раз добавлен в Избранное',

    'already_exists' => 'Этот документ уже добавлен в Избранное',

    'errors' => [

        'invalidargumentexception' => 'Невозможно добавить в Избранное. (:exception)',

    ],

];
