<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Starred Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used for localizing messages that pertain
    | to the starred feature.
    |
    */
    'add' => 'Добавить в Избранное',
    'remove' => 'Удалить из Избранного',
    'empty_message' => 'Здесь показаны важные и интересные вам документы',

    'page_title' => 'Избранное',

    'starred_count' => '{0} нет документов в Избранное|{1} документ в Избранное|{2,4} документа в Избранное|{5,*} документов в Избранное',
    'starred_count_alt' => '{0} документ не добавлен в Избранное|{1} раз добавлен в Избранное|{2,4} раза добавлен в Избранное|{5,*} раз добавлен в Избранное',

    'already_exists' => 'Этот документ уже добавлен в Избранное',

    'errors' => [

        'invalidargumentexception' => 'Невозможно добавить в Избранное. (:exception)',

    ],

];
