<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Upload Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used primarly for the video uploader
    |
    */

    'start' => 'Начать загрузку',
    'remove' => 'Удалить из списка загрузок',
    'open_file_location' => 'Показать в коллекции',
    'cancel' => 'Отменить загрузку',
    'cancel_question' => 'Вы действительно хотите прервать загрузку?',

    'action_drop' => 'Переместите файлы сюда для начала загрузки',
    'action_select' => 'Выбрать',




    'status' => [
    ],
];
